sabre_docs/GetPassengerDataRQ_v4-0-4_Samples/GetPassengerDataRQ_v4-0-0_SamplePayload_4_2_2_1.xml

<SamplePayloads>
<!--Request-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:v4="http://services.sabre.com/checkin/getPassengerData/v4">
   <soapenv:Header>
      <eb:MessageHeader eb:id="" eb:version="1.0" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="URI">Client</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="URI">Server</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
         <eb:Service>GetPassengerDataRQ</eb:Service>
         <eb:Action>GetPassengerDataRQ</eb:Action>
         <eb:MessageData>
            <eb:MessageId>mid:1</eb:MessageId>
            <eb:Timestamp>2008-03-03T12:45:52</eb:Timestamp>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken EncodingType="wsse:Base64Binary" valueType="String">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSA!ICESMSLB\/STS.LB!-3426225814307755132!758984!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <v4:GetPassengerDataRQ validateCheckInRequirements="true">
         <!--You have a CHOICE of the next 2 items at this level-->
         <ItineraryAndPassengerInfo>
            <Itinerary>
               <Airline>AZ</Airline>
               <Flight>4</Flight>
               <DepartureDate>2016-03-16</DepartureDate>
               <Origin>FCO</Origin>
            </Itinerary>
           <Seat>42C</Seat>
         </ItineraryAndPassengerInfo>
      </v4:GetPassengerDataRQ>
   </soapenv:Body>
</soapenv:Envelope>

<!--Response-->

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
   <soap-env:Header>
      <eb:MessageHeader eb:version="1.0" soap-env:mustUnderstand="1" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="URI">Server</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="URI">Client</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
         <eb:Service>GetPassengerDataRQ</eb:Service>
         <eb:Action>GetPassengerDataRS</eb:Action>
         <eb:MessageData>
            <eb:MessageId>ba686c1d-6c78-444f-a0b3-81aa77618c61@176</eb:MessageId>
            <eb:Timestamp>2016-03-16T13:07:59</eb:Timestamp>
            <eb:RefToMessageId>mid:1</eb:RefToMessageId>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSA!ICESMSLB\/STS.LB!-3426225814307755132!758984!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soap-env:Header>
   <soap-env:Body>
      <ns3:GetPassengerDataRS xmlns:ns3="http://services.sabre.com/checkin/getPassengerData/v4" xmlns:ns2="http://services.sabre.com/STL/v3">
         <PassengerDataResponseList>
            <PassengerDataResponse>
               <LineNumber>1</LineNumber>
               <LastName>STEVE</LastName>
               <FirstName>J</FirstName>
               <PassengerID>B784C60F0001</PassengerID>
               <PNRLocator nameAssociationID="1">OJLCOK</PNRLocator>
               <VCRNumber couponNumber="1">0552120002468</VCRNumber>
               <PassengerItineraryList>
                  <PassengerItinerary>
                     <SegmentID>1</SegmentID>
                     <Airline>AZ</Airline>
                     <Flight>4</Flight>
                     <BookingClass>Y</BookingClass>
                     <Origin>FCO</Origin>
                     <Destination>TRN</Destination>
                     <DepartureDate>2016-03-16</DepartureDate>
                     <Cabin>Y</Cabin>
                     <Seat>42C</Seat>
                     <BoardingPassFlag>*</BoardingPassFlag>
                     <PassengerType>F</PassengerType>
                     <BagCount>1</BagCount>
                     <EditCodeList>
                        <ns2:EditCode>M</ns2:EditCode>
                        <ns2:EditCode>ET</ns2:EditCode>
                        <ns2:EditCode>DOCV</ns2:EditCode>
                        <ns2:EditCode>DOCS</ns2:EditCode>
                        <ns2:EditCode>ETI</ns2:EditCode>
                     </EditCodeList>
                     <CheckInNumber>1</CheckInNumber>
                     <BagTagInfoList>
                        <BagTagInfo>
                           <ns2:BagTagNumber>9055300200</ns2:BagTagNumber>
                           <ns2:WeightAndSize>
                              <ns2:WeightAndUnit unit="KG">10</ns2:WeightAndUnit>
                           </ns2:WeightAndSize>
                           <ns2:Airline>AZ</ns2:Airline>
                           <ns2:BagOrigin>FCO</ns2:BagOrigin>
                           <ns2:BagFinalDestination>TRN</ns2:BagFinalDestination>
                        </BagTagInfo>
                     </BagTagInfoList>
                  </PassengerItinerary>
               </PassengerItineraryList>
               <FreeTextInfoList>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>BT</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>AZ TRN    9055300200.10</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>BT</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>1 / 10 KG</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCS</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>P/US/123456789/US/01JAN70/F/01JAN20/ALPHA/PAX</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>ET</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>0552120002468  C01 16MAR Y FCOTRN CKIN</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
               </FreeTextInfoList>
            </PassengerDataResponse>
         </PassengerDataResponseList>
         <Result messageId="ID-acs-int2-sgdcelab-sabre-com-37969-1458126856426-2-2236" timeStamp="2016-03-16T13:07:59.330Z">
            <ns2:Status>Success</ns2:Status>
            <ns2:CompletionStatus>Complete</ns2:CompletionStatus>
            <ns2:System>ACS-BSO</ns2:System>
         </Result>
      </ns3:GetPassengerDataRS>
   </soap-env:Body>
</soap-env:Envelope>
</SamplePayloads>