sabre_docs/GetPassengerDataRQ_v4-0-4_Samples/GetPassengerDataRQ_v4-0-4_SamplePayload_4_2_2_3_3b.xml

<SamplePayloads>
<!--Request-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:v4="http://services.sabre.com/checkin/getPassengerData/v4">
   <soapenv:Header>
      <eb:MessageHeader eb:id="" eb:version="1.0" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="URI">Client</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="URI">Server</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
         <eb:Service>GetPassengerDataRQ</eb:Service>
         <eb:Action>GetPassengerDataRQ</eb:Action>
         <eb:MessageData>
            <eb:MessageId>mid:1</eb:MessageId>
            <eb:Timestamp>2008-03-03T12:45:52</eb:Timestamp>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken EncodingType="wsse:Base64Binary" valueType="String">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSB!ICESMSLB\/STS.LB!-3012605245420488312!284601!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <v4:GetPassengerDataRQ version='4.0.4' validateCheckInRequirements="true">
         <!--You have a CHOICE of the next 2 items at this level-->
         <ItineraryAndPassengerInfo>
            <Itinerary>
            <Airline>EY</Airline>
            <!--Optional:-->
            <Flight>6418</Flight>
            <!--Optional:-->
            <DepartureDate>2019-05-29</DepartureDate>
            <Origin>SYD</Origin>
         </Itinerary>
            <PassengerList>
               <Passenger>
                    <LastName>HORN</LastName>
                  <!--PassengerID>ED5ADFAE0201</PassengerID-->
                 <PNRLocator>QKZOBC</PNRLocator> 
               </Passenger>
            </PassengerList>
         </ItineraryAndPassengerInfo>
      </v4:GetPassengerDataRQ>
   </soapenv:Body>
</soapenv:Envelope>

<!--Request-->

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
   <soap-env:Header>
      <eb:MessageHeader eb:version="1.0" soap-env:mustUnderstand="1" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="URI">Server</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="URI">Client</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
         <eb:Service>GetPassengerDataRQ</eb:Service>
         <eb:Action>GetPassengerDataRS</eb:Action>
         <eb:MessageData>
            <eb:MessageId>319856235141060610</eb:MessageId>
            <eb:Timestamp>2019-05-29T06:31:58</eb:Timestamp>
            <eb:RefToMessageId>mid:1</eb:RefToMessageId>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSB!ICESMSLB\/STS.LB!-3012605245420488312!284601!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soap-env:Header>
   <soap-env:Body>
      <ns3:GetPassengerDataRS xmlns:ns3="http://services.sabre.com/checkin/getPassengerData/v4" xmlns:ns2="http://services.sabre.com/STL/v3">
         <PassengerDataResponseList>
            <PassengerDataResponse>
               <LineNumber>1</LineNumber>
               <LastName>HORN</LastName>
               <FirstName>YVETTE</FirstName>
               <PassengerID>F335D0A70001</PassengerID>
               <PNRLocator nameAssociationID="1">QKZOBC</PNRLocator>
               <VCRNumber couponNumber="1">6072137041423</VCRNumber>
               <BaggageRouteList>
                  <ns2:BaggageRoute>
                     <ns2:SegmentID>1</ns2:SegmentID>
                     <ns2:Airline>EY</ns2:Airline>
                     <ns2:Flight>6418</ns2:Flight>
                     <ns2:BookingClass>L</ns2:BookingClass>
                     <ns2:MarketingBookingClass>L</ns2:MarketingBookingClass>
                     <ns2:OperatingBookingClass>N</ns2:OperatingBookingClass>
                     <ns2:OperatingAirline>VA</ns2:OperatingAirline>
                     <ns2:OperatingFlight>880</ns2:OperatingFlight>
                     <ns2:Origin>SYD</ns2:Origin>
                     <ns2:Destination>MEL</ns2:Destination>
                     <ns2:DepartureDate>2019-05-29</ns2:DepartureDate>
                     <ns2:DepartureTime>06:45PM</ns2:DepartureTime>
                     <ns2:ArrivalDate>2019-05-29</ns2:ArrivalDate>
                     <ns2:ArrivalTime>08:20PM</ns2:ArrivalTime>
                     <ns2:SegmentStatus>HK</ns2:SegmentStatus>
                     <ns2:PassengerID>F335D0A70001</ns2:PassengerID>
                  </ns2:BaggageRoute>
               </BaggageRouteList>
               <PassengerItineraryList>
                  <PassengerItinerary>
                     <SegmentID>1</SegmentID>
                     <Airline>EY</Airline>
                     <Flight>6418</Flight>
                     <OperatingAirline>VA</OperatingAirline>
                     <OperatingFlight>880</OperatingFlight>
                     <MarketingAirline>EY</MarketingAirline>
                     <MarketingFlight>6418</MarketingFlight>
                     <ThirdPartyGroundHandled>false</ThirdPartyGroundHandled>
                     <BookingClass>L</BookingClass>
                     <MarketingBookingClass>L</MarketingBookingClass>
                     <OperatingBookingClass>N</OperatingBookingClass>
                     <Origin>SYD</Origin>
                     <Destination>MEL</Destination>
                     <DepartureDate>2019-05-29</DepartureDate>
                     <AircraftType>C2C</AircraftType>
                     <Cabin>Y</Cabin>
                     <PassengerType>F</PassengerType>
                     <BagCount>0</BagCount>
                     <TotalBagWeightAndUnit>0</TotalBagWeightAndUnit>
                     <EditCodeList>
                        <ns2:EditCode>DOCS</ns2:EditCode>
                        <ns2:EditCode>ETI</ns2:EditCode>
                     </EditCodeList>
                     <VCRInfoList>
                        <VCRInfo>
                           <VCRNumber couponNumber="1">6072137041423</VCRNumber>
                           <FareBasisCode>Y</FareBasisCode>
                        </VCRInfo>
                     </VCRInfoList>
                     <RequiredInfoList>
                        <RequiredInfo>
                           <Code>GENDER</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>ENTER GENDER FOR PSGR</FreeText>
                        </RequiredInfo>
                        <RequiredInfo>
                           <Code>BTP</Code>
                           <FreeText>ALLOW BAGTAG ISSUANCE PRIOR TO PAYMENT</FreeText>
                        </RequiredInfo>
                     </RequiredInfoList>
                  </PassengerItinerary>
               </PassengerItineraryList>
               <RequiredInfoSumList>
                  <RequiredInfo>
                     <Code>GENDER</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>ENTER GENDER FOR PSGR</FreeText>
                  </RequiredInfo>
                  <RequiredInfo>
                     <Code>BTP</Code>
                     <FreeText>ALLOW BAGTAG ISSUANCE PRIOR TO PAYMENT</FreeText>
                  </RequiredInfo>
               </RequiredInfoSumList>
               <PassengerEditList/>
               <FreeTextInfoList>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCS</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>P/EST/0QRWPWC8UL/EST/15FEB98/F/30JUN27/HORN/YVETTE</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
               </FreeTextInfoList>
            </PassengerDataResponse>
         </PassengerDataResponseList>
         <Result messageId="ID-acs-int1-sgdcelab-sabre-com-1559109392737-2-167" timeStamp="2019-05-29T06:31:55.316Z">
            <ns2:Status>Success</ns2:Status>
            <ns2:CompletionStatus>Complete</ns2:CompletionStatus>
            <ns2:System>ACS-BSO</ns2:System>
         </Result>
      </ns3:GetPassengerDataRS>
   </soap-env:Body>
</soap-env:Envelope>
</SamplePayloads>